set_device -family {PolarFireSoC} -die {MPFS250TS} -speed {-1}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERESET\CORERESET_0\core\corereset_pf.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERESET\CORERESET.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\INIT_MONITOR\INIT_MONITOR_0\INIT_MONITOR_INIT_MONITOR_0_PFSOC_INIT_MONITOR.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\INIT_MONITOR\INIT_MONITOR.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CCC_C0\PF_CCC_C0_0\PF_CCC_C0_PF_CCC_C0_0_PF_CCC.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CCC_C0\PF_CCC_C0.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CLK_DIV_C0\PF_CLK_DIV_C0_0\PF_CLK_DIV_C0_PF_CLK_DIV_C0_0_PF_CLK_DIV.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CLK_DIV_C0\PF_CLK_DIV_C0.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_OSC_C0\PF_OSC_C0_0\PF_OSC_C0_PF_OSC_C0_0_PF_OSC.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_OSC_C0\PF_OSC_C0.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_XCVR_REF_CLK_C0\PF_XCVR_REF_CLK_C0_0\PF_XCVR_REF_CLK_C0_PF_XCVR_REF_CLK_C0_0_PF_XCVR_REF_CLK.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_XCVR_REF_CLK_C0\PF_XCVR_REF_CLK_C0.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CLOCKS_AND_RESETS\CLOCKS_AND_RESETS.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ResetSycnc.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RoundRobinArb.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\MasterAddressDecoder.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DependenceChecker.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\BitScan0.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\TransactionController.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\MasterControl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\TargetMuxController.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\AddressController.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\Revision.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DERR_Slave.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DualPort_FF_SyncWr_SyncRd.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\DualPort_Ram_SyncWr_SyncRd.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RdFifoDualPort.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ReadDataMux.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RequestQual.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\ReadDataController.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RDataController.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\SlaveDataMuxController.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\RespController.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\FifoDualPort.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\WriteDataMux.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\WDataController.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4CrossBar\Axi4CrossBar.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AHBL_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AXI4_Read_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AXI4_Write_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\AHB_SM.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrAHBtoAXI4Converter.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\Bin2Gray.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_grayCodeCounter.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_rdCtrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_wrCtrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RAM_BLOCK.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\CDC_FIFO.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrClockDomainCrossing.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_CmdFifoWriteCtrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\Hold_Reg_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_Hold_Reg_Rd.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_preCalcCmdFifoWrCtrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_widthConvrd.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_CTRL.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\byte2bit.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_readWidthConv.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_Hold_Reg_Wr.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_widthConvwr.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_brespCtrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_DownConv_writeWidthConv.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DownConverter.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_AChannel.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_BChannel.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChannel_SlvRid_Arb.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChan_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_preCalcRChan_Ctrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_downsizing.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_RChannel.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChan_Hold_Reg.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChan_ReadDataFifoCtrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_Wchan_WriteDataFifoCtrl.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\FIFO_upsizing.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_WChannel.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\DWC_UpConv_preCalcAChannel.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\UpConverter.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrDataWidthConv.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MstrProtocolConverter.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RegSliceFull.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\RegisterSlice.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\MasterConvertor.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvClockDomainCrossing.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvDataWidthConverter.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvAXI4ID.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvRead.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtConvWrite.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvAxi4ProtocolConv.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlvProtocolConverter.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\Axi4Convertors\SlaveConvertor.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREAXI4INTERCONNECT\2.8.103\rtl\vlog\core\CoreAxi4Interconnect.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\COREAXI4INTERCONNECT_C0\COREAXI4INTERCONNECT_C0.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\FIC_CONVERTER\FIC_CONVERTER.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\MSS_VIDEO_KIT_H264_MM\MSS_VIDEO_KIT_H264_MM.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERESET_PF_C1\CORERESET_PF_C1_0\core\corereset_pf.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERESET_PF_C1\CORERESET_PF_C1.v}
read_verilog -mode system_verilog -lib CORERXIODBITALIGN_LIB {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERXIODBITALIGN_C1\CORERXIODBITALIGN_C1_0\rtl\vlog\core\CoreRxIODBitAlign.v}
read_verilog -mode system_verilog -lib CORERXIODBITALIGN_LIB {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERXIODBITALIGN_C1\CORERXIODBITALIGN_C1_0\rtl\vlog\core\CoreRxIODBitAlign_top.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERXIODBITALIGN_C1\CORERXIODBITALIGN_C1.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_CLK_DIV_FIFO\PF_IOD_GENERIC_RX_C0_PF_CLK_DIV_FIFO_PF_CLK_DIV_DELAY.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_CLK_DIV_RXCLK\PF_IOD_GENERIC_RX_C0_PF_CLK_DIV_RXCLK_PF_CLK_DIV_DELAY.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_IOD_CLK_TRAINING\PF_IOD_GENERIC_RX_C0_PF_IOD_CLK_TRAINING_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_IOD_RX\PF_IOD_GENERIC_RX_C0_PF_IOD_RX_PF_IOD.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_LANECTRL_0\PF_LANECTRL_PAUSE_SYNC.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_LANECTRL_0\PF_IOD_GENERIC_RX_C0_PF_LANECTRL_0_PF_LANECTRL.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREBCLKSCLKALIGN\2.0.111\rtl\vlog\core\PLL_BclkSclkAlign.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Actel\DirectCore\COREBCLKSCLKALIGN\2.0.111\rtl\vlog\core\ICB_BclkSclkAlign.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0_TR\PF_IOD_GENERIC_RX_C0_TR_0\rtl\vlog\core\CoreBclkSclkAlign.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0_TR\PF_IOD_GENERIC_RX_C0_TR.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_IOD_GENERIC_RX_C0.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CAM_IOD_TIP_TOP\CAM_IOD_TIP_TOP.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERESET_PF_C2\CORERESET_PF_C2_0\core\corereset_pf.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERESET_PF_C2\CORERESET_PF_C2.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERESET_PF_C5\CORERESET_PF_C5_0\core\corereset_pf.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERESET_PF_C5\CORERESET_PF_C5.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CCC_C2\PF_CCC_C2_0\PF_CCC_C2_PF_CCC_C2_0_PF_CCC.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CCC_C2\PF_CCC_C2.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\mipicsi2rxdecoderPF\5.0.0\Encrypted\mipicsi2rxdecoderPF.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\mipicsi2rxdecoderPF_C0\mipicsi2rxdecoderPF_C0.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\IMX334_IF_TOP\IMX334_IF_TOP.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\corefifo_NstagesSync_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\corefifo_grayToBinConv_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\corefifo_async_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\corefifo_resetSync_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\corefifo_sync_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\corefifo_fwft_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\corefifo_sync_scntr_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\LSRAM_top_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\ram_wrapper_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\video_axi_fifo_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\ddr_rw_arbiter_vdma.v}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\read_mux_vdma.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\read_demux_vdma.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\request_scheduler_vdma.vhd}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\read_top_vdma.v}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\write_mux_vdma.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\write_demux_vdma.vhd}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\write_top_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\ddr_axi4_arbiter_native_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\ddr_axi4_arbiter_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\axi4lite_if_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\synchronizer_circuit_2stage_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\interrupt_controller_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\vdma_ip_reset.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\async_fifo_vdma.v}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\data_packer_vdma.vhd}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\ddr_write_controller_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\ddr_write_vdma.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\vdma_controller.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\vdma_write.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\vdma_dma_top.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\VDMA\1.0.0\RTL\VDMA.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\VDMA_C0\VDMA_C0.v}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microsemi\SolutionCore\Bayer_Interpolation\4.7.0\Encrypted\Bayer_Interpolation.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\Bayer_Interpolation_C0\Bayer_Interpolation_C0.vhd}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\hdl\CR_OSD.v}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microsemi\SolutionCore\Gamma_Correction\4.3.0\Encrypted\Gamma_Correction.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\Gamma_Correction_C0\Gamma_Correction_C0.vhd}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\H264_Iframe_Encoder\1.5.0\Evaluation\H264_Iframe_Encoder_Eval_enc.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\H264_Iframe_Encoder_C0\H264_Iframe_Encoder_C0.v}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\IMAGE_SCALER\4.2.0\Encrypted\Image_Scaler.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\IMAGE_SCALER_C0\IMAGE_SCALER_C0.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microchip\SolutionCore\Image_Enhancement\4.5.0\Encrypted\Image_Enhancement.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\Image_Enhancement_C0\Image_Enhancement_C0.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\Microsemi\SolutionCore\RGBtoYCbCr\4.4.0\Encrypted\RGBtoYCbCr.vhd}
read_vhdl -mode vhdl_2008 {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\RGBtoYCbCr_C0\RGBtoYCbCr_C0.vhd}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\video_processing\video_processing.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\Video_Pipeline\Video_Pipeline.v}
read_verilog -mode system_verilog {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\VKPFSOC_H264_MM\VKPFSOC_H264_MM.v}
set_top_level {VKPFSOC_H264_MM}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\COREAXI4INTERCONNECT_C0\COREAXI4INTERCONNECT_C0_0\COREAXI4INTERCONNECT_C0.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\CORERXIODBITALIGN_C1\CORERXIODBITALIGN_C1_0\CORERXIODBITALIGN_C1.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\H264_Iframe_Encoder_C0\H264_Iframe_Encoder_C0_0\H264_Iframe_Encoder_C0.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\Image_Enhancement_C0\Image_Enhancement_C0_0\Image_Enhancement_C0.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\IMAGE_SCALER_C0\IMAGE_SCALER_C0_0\IMAGE_SCALER_C0.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\mipicsi2rxdecoderPF_C0\mipicsi2rxdecoderPF_C0_0\mipicsi2rxdecoderPF_C0.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\MSS_VIDEO_KIT_H264_MM\MSS_VIDEO_KIT_H264_MM.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CCC_C0\PF_CCC_C0_0\PF_CCC_C0_PF_CCC_C0_0_PF_CCC.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CCC_C2\PF_CCC_C2_0\PF_CCC_C2_PF_CCC_C2_0_PF_CCC.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_CLK_DIV_C0\PF_CLK_DIV_C0_0\PF_CLK_DIV_C0_PF_CLK_DIV_C0_0_PF_CLK_DIV.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_CLK_DIV_FIFO\PF_IOD_GENERIC_RX_C0_PF_CLK_DIV_FIFO_PF_CLK_DIV_DELAY.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_CLK_DIV_RXCLK\PF_IOD_GENERIC_RX_C0_PF_CLK_DIV_RXCLK_PF_CLK_DIV_DELAY.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0\PF_IOD_GENERIC_RX_C0.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\PF_IOD_GENERIC_RX_C0_TR\PF_IOD_GENERIC_RX_C0_TR_0\PF_IOD_GENERIC_RX_C0_TR.sdc}
read_sdc -component {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\component\work\VDMA_C0\VDMA_C0_0\VDMA_C0.sdc}
derive_constraints
write_sdc {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\constraint\VKPFSOC_H264_MM_derived_constraints.sdc}
write_ndc {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\constraint\VKPFSOC_H264_MM_derived_constraints.ndc}
write_pdc {C:\Users\katia\OneDrive\Documents\work2\CAN\MPFS250_Video_Kit\VKPFSOC_H264_MM\constraint\fp\VKPFSOC_H264_MM_derived_constraints.pdc}
